'''Blur types'''

# сумма всех элементов должа быть равна 1
# размер матрицы оставляем 3 на 3, так как в функции Blur при вычислении используется поле 3 на 3

standart_3x3 = [
        [0.0625, 0.125, 0.0625],
        [0.125, 0.25, 0.125],
        [0.0625, 0.125, 0.0625]
    ]

cross_3x3 = [
        [0.15, 0.0, 0.15],
        [0.0, 0.4, 0.0],
        [0.15, 0.0, 0.15]
    ]

horizontal = [
        [0.0, 0.0, 0.0],
        [0.25, 0.5, 0.25],
        [0.0, 0.0, 0.0]
    ]

vertical = [
        [0.0, 0.25, 0.0],
        [0.0, 0.5, 0.0],
        [0.0, 0.25, 0.0]
    ]