import random
import time

# Файл генератора без использования сторонних библиотек
# Немного обрезанный (все границы будут обрабатываться как wrap)

class SeedClass:

    seed = str(time.time())
    random.seed(a=seed, version=2)
    # np.random.seed(seed=random.randint(0, 2^32 - 1))

    @staticmethod
    def ChangeSeed(new_seed: str):
        SeedClass.seed = new_seed
        random.seed(a=new_seed, version=2)
        # np.random.seed(seed=random.randint(0, 2^32 - 1))


class NeighborhoodClass:
    '''
    Класс, в котором храняться ядра свертки, определяющее соседство клеток.
    Квадратная матрица нечетных размеров, где единицы обозначают клетки,
    учитываемые при расчете соседства, а нули - не учитываемые.
    '''


    standart3x3 = [
        [1, 1, 1],
        [1, 1, 1],
        [1, 1, 1]
    ]
    '''
    1 1 1\n
    1 1 1\n
    1 1 1
    '''

    moore_neighborhood_1order = [
        [1, 1, 1],
        [1, 0, 1],
        [1, 1, 1]
    ]
    '''
    1 1 1\n
    1 0 1\n
    1 1 1
    '''

    moore_neighborhood_2order = [
        [1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1],
        [1, 1, 0, 1, 1],
        [1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1]
    ]
    '''
    1 1 1 1 1\n
    1 1 1 1 1\n
    1 1 0 1 1\n
    1 1 1 1 1\n
    1 1 1 1 1
    '''

    plus = [
        [0, 1, 0],
        [1, 1, 1],
        [0, 1, 0]
    ]
    '''
    0 1 0\n
    1 1 1\n
    0 1 0
    '''

    cross = [
        [1, 0, 1],
        [0, 1, 0],
        [1, 0, 1]
    ]
    '''
    1 0 1\n
    0 1 0\n
    1 0 1
    '''

    horizontal_1order = [
        [0, 0, 0],
        [1, 1, 1],
        [0, 0, 0]
    ]
    '''
    0 0 0\n
    1 1 1\n
    0 0 0
    '''

    vertical_1order = [
        [0, 1, 0],
        [0, 1, 0],
        [0, 1, 0]
    ]
    '''
    0 1 0\n
    0 1 0\n
    0 1 0
    '''

    horizontal_2order = [
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
        [1, 1, 1, 1, 1],
        [0, 0, 0, 0, 0],
        [0, 0, 0, 0, 0],
    ]
    '''
    0 0 0 0 0\n
    0 0 0 0 0\n
    1 1 1 1 1\n
    0 0 0 0 0\n
    0 0 0 0 0
    '''

    vertical_2order = [
        [0, 0, 1, 0, 0],
        [0, 0, 1, 0, 0],
        [0, 0, 1, 0, 0],
        [0, 0, 1, 0, 0],
        [0, 0, 1, 0, 0],
    ]
    '''
    0 0 1 0 0\n
    0 0 1 0 0\n
    0 0 1 0 0\n
    0 0 1 0 0\n
    0 0 1 0 0
    '''


class BlurClass:
    '''
    Класс, в котором храняться ядра свертки для размытия.
    '''

    # сумма всех элементов должа быть равна 1

    standart3x3 = [
        [0.0625, 0.125, 0.0625],
        [0.125, 0.25, 0.125],
        [0.0625, 0.125, 0.0625]
    ]
    '''
    [[0.0625, 0.125, 0.0625],\n
    [0.125, 0.25, 0.125],\n
    [0.0625, 0.125, 0.0625]]
    '''

    standart5x5 = [
        [0.00296902, 0.01330621, 0.02193823, 0.01330621, 0.00296902],
        [0.01330621, 0.0596343,  0.09832033, 0.0596343,  0.01330621],
        [0.02193823, 0.09832033, 0.16210282, 0.09832033, 0.02193823],
        [0.01330621, 0.0596343,  0.09832033, 0.0596343,  0.01330621],
        [0.00296902, 0.01330621, 0.02193823, 0.01330621, 0.00296902]
    ]
    '''
    [[0.00296902, 0.01330621, 0.02193823, 0.01330621, 0.00296902],\n
    [0.01330621, 0.0596343,  0.09832033, 0.0596343,  0.01330621],\n
    [0.02193823, 0.09832033, 0.16210282, 0.09832033, 0.02193823],\n
    [0.01330621, 0.0596343,  0.09832033, 0.0596343,  0.01330621],\n
    [0.00296902, 0.01330621, 0.02193823, 0.01330621, 0.00296902]]
    '''

    outside = [
        [0.125, 0.125, 0.125],
        [0.125, 0.0, 0.125],
        [0.125, 0.125, 0.125]
    ]
    '''
    [[0.125, 0.125, 0.125],\n
    [0.125, 0.0, 0.125],\n
    [0.125, 0.125, 0.125]]
    '''

    square = [
        [0.111111, 0.111111, 0.111111],
        [0.111111, 0.111111, 0.111111],
        [0.111111, 0.111111, 0.111111]
    ]
    '''
    [[0.111111, 0.111111, 0.111111],\n
    [0.111111, 0.111111, 0.111111],\n
    [0.111111, 0.111111, 0.111111]]
    '''

    cross = [
        [0.15, 0.0, 0.15],
        [0.0, 0.4, 0.0],
        [0.15, 0.0, 0.15]
    ]
    '''
    [[0.15, 0.0, 0.15],\n
    [0.0, 0.4, 0.0],\n
    [0.15, 0.0, 0.15]]
    '''

    plus = [
        [0.0, 0.15, 0.0],
        [0.15, 0.4, 0.15],
        [0.0, 0.15, 0.0]
    ]
    '''
    [[0.0, 0.15, 0.0],\n
    [0.15, 0.4, 0.15],\n
    [0.0, 0.15, 0.0]]
    '''


    outside_standart = [
        [0.083333, 0.166666, 0.083333],
        [0.166666, 0.0, 0.166666],
        [0.083333, 0.166666, 0.083333]
    ]
    '''
    [[0.083333, 0.166666, 0.083333],\n
    [0.166666, 0.0, 0.166666],\n
    [0.083333, 0.166666, 0.083333]]
    '''

    outside_cross = [
        [0.25, 0.0, 0.25],
        [0.0, 0.0, 0.0],
        [0.25, 0.0, 0.25]
    ]
    '''
    [[0.25, 0.0, 0.25],\n
    [0.0, 0.0, 0.0],\n
    [0.25, 0.0, 0.25]]
    '''

    outside_plus = [
        [0.0, 0.25, 0.0],
        [0.25, 0.0, 0.25],
        [0.0, 0.25, 0.0]
    ]
    '''
    [[0.0, 0.25, 0.0],\n
    [0.25, 0.0, 0.25],\n
    [0.0, 0.25, 0.0]]
    '''

    horizontal = [
        [0.0, 0.0, 0.0],
        [0.25, 0.5, 0.25],
        [0.0, 0.0, 0.0]
    ]
    '''
    [[0.0, 0.0, 0.0],\n
    [0.25, 0.5, 0.25],\n
    [0.0, 0.0, 0.0]]
    '''

    vertical = [
        [0.0, 0.25, 0.0],
        [0.0, 0.5, 0.0],
        [0.0, 0.25, 0.0]
    ]
    '''
    [[0.0, 0.25, 0.0],\n
    [0.0, 0.5, 0.0],\n
    [0.0, 0.25, 0.0]]
    '''

    horizontal_cross = [
        [0.1, 0.0, 0.1],
        [0.15, 0.3, 0.15],
        [0.1, 0.0, 0.1]
    ]
    '''
    [[0.1, 0.0, 0.1],\n
    [0.15, 0.3, 0.15],\n
    [0.1, 0.0, 0.1]]
    '''

    vertical_cross = [
        [0.1, 0.15, 0.1],
        [0.0, 0.3, 0.0],
        [0.1, 0.15, 0.1]
    ]
    '''
    [[0.1, 0.15, 0.1],\n
    [0.0, 0.3, 0.0],\n
    [0.1, 0.15, 0.1]]
    '''

    down = [
        [0.15, 0.2, 0.15],
        [0.0, 0.4, 0.0],
        [0.0, 0.0, 0.0]
    ]
    '''
    [[0.15, 0.2, 0.15],\n
    [0.0, 0.4, 0.0],\n
    [0.0, 0.0, 0.0]]
    '''


class GradientClass:
#     '''
#     Класс, в котором хранятся разные градиенты
#     и функции чтения и записи этих градиентов
#     '''


#     black_to_white = [(0, 0, 0), (28, 28, 28), (56, 56, 56), (85, 85, 85), (113, 113, 113), (141, 141, 141), (170, 170, 170), (198, 198, 198), (226, 226, 226), (255, 255, 255)]
#     ocean_beach_forest = [(5, 6, 27), (11, 15, 134), (25, 68, 178), (60, 143, 215), (60, 208, 215), (237, 255, 68), (79, 255, 0), (70, 200, 11), (29, 145, 32), (9, 110, 12)]
#     black_orange_yellow_white = [(0, 0, 0, 255), (63, 27, 0, 255), (127, 54, 0, 255), (191, 81, 0, 255), (255, 108, 0, 255), (255, 157, 0, 255), (255, 206, 0, 255), (255, 255, 0, 255), (255, 255, 127, 255), (255, 255, 255, 255)]
#     dark_grey_brown = [(42, 39, 30), (48, 46, 39), (55, 53, 48), (67, 65, 59), (79, 77, 71), (91, 89, 83), (103, 101, 95), (116, 113, 107), (91, 89, 83), (55, 53, 48)]
#     grass = [(21, 21, 21), (23, 27, 24), (26, 33, 27), (28, 40, 31), (31, 46, 34), (34, 53, 38), (42, 69, 47), (50, 85, 57), (59, 102, 67), (69, 119, 77)]

#     all_gradients = [black_to_white, ocean_beach_forest, black_orange_yellow_white, dark_grey_brown, grass]

#     def ReadGradient(path: str):
#         '''
#         Функция чтения градиента из файла
#         ---
#         Параметры:\n
#         - path: str - путь до файла.
#         ---
#         Возвращает:\n
#         - list - Массив с цветами градиента.\n
#         '''

#         to_read = Image.open(path)
#         gradient = [to_read.getpixel((x, 0)) for x in range(0, 10)]
#         return gradient


#     def SaveGradient(gradient: list, path: str):
#         '''
#         Функция сохранения градиента в файл\n
#         ---
#         Параметры:\n
#         - gradient: list - Массив с цветами градиента.\n
#         - path: str - путь до файла.
#         '''

#         to_save = Image.new('RGBA', (10, 1))
#         to_save.putdata(gradient)
#         to_save.save(path)
    pass


def InitializeField(chances: list, shape: tuple) -> list:
    '''
    Функция случайного заполнения клеток числами из chances в матрицу с размерами shape.
    ---
    Параметры:\n
    - chances: list - Массив с значениями, из которых потом будет случайным образом наполнятся клетки матрицы.\n
    - shape: tuple - размеры матрицы.
    ---
    Возвращает:\n
    - np.ndarray - Матрица со случайными значениями.\n
    '''
    field = []

    for y in range(shape[1]):
        field.append([])
        for x in range(shape[0]):
            field[y].append(chances[random.randint(0, len(chances) - 1)])

    return field


def RunAutomaton(
                field: list,
                live_cell_value: int,
                dead_cell_value: int,
                birth_rule: list,
                survive_rule: list,
                num_iterations: int,
                neighborhood_kernel: list
                ) -> list:
    """
    Запускает процесс клеточного автомата для заданного количества итераций.

    Параметры:
    - field: list - Исходное поле, представляющее собой матрицу чисел.
    - live_cell_value: int - Значение, обозначающее "живую" клетку.
    - dead_cell_value: int - Значение, обозначающее "мертвую" клетку.
    - birth_rule: list - Кол-во соседей, при которых "мертвая" клетка "оживает".
    - survive_rule: list - Кол-во соседей, при которых "живая" клетка остается "живой".
    - num_iterations: int - Количество итераций для выполнения клеточного автомата.
    - neighborhood_kernel: list - Ядро соседства, квадратная матрица нечетного размера с 1 и 0.
    
    Возвращает:
    - list - Матрица после выполнения всех итераций клеточного автомата.
    """
    
    field_copy = []
    next_field = []
    field_width = len(field)
    field_height = len(field[0])
    kernel_size = len(neighborhood_kernel)
    kernel_radius = kernel_size // 2

    # копирование массивов (без этого будет ошибки)
    for y in range(field_width):
        field_copy.append(field[y].copy())

    # Выполнение указанного числа итераций
    for _ in range(num_iterations):
        # Создаем копию поля для вычислений
        for y in range(field_width):
            next_field.append(field[y].copy())

        for y in range(field_width):
            for x in range(field_height):
                # Подсчет живых соседей
                live_neighbors = 0
                for ky in range(-kernel_radius, kernel_radius + 1):
                    for kx in range(-kernel_radius, kernel_radius + 1):
                        ny = (y + ky) % field_width  # Закольцованная координата по вертикали
                        nx = (x + kx) % field_height  # Закольцованная координата по горизонтали
                        if neighborhood_kernel[ky + kernel_radius][kx + kernel_radius] == 1:
                            if field_copy[ny][nx] == live_cell_value:
                                live_neighbors += 1

                # Применение правил рождения и выживания
                if field_copy[y][x] == live_cell_value:
                    # Проверка правила выживания
                    if live_neighbors not in survive_rule:
                        next_field[y][x] = dead_cell_value
                elif field_copy[y][x] == dead_cell_value:
                    # Проверка правила рождения
                    if live_neighbors in birth_rule:
                        next_field[y][x] = live_cell_value

        # Обновление текущего состояния поля
        field_copy = []
        for y in range(field_width):
            field_copy.append(next_field[y].copy())

    return field_copy


def AverageAmountOfFields(*fields):
    '''
    Функция, которая складвает все матрицы, после деля каждое значение на кол-во матриц.
    ---
    Параметры:\n
    - *fields - массив с матрицами
    ---
    Возвращает:\n
    - list - Итоговая матрица.
    '''
    field_result = []
    for y in range(len(fields[0])):
        field_result.append([])
        for x in range(len(fields[0][0])):
            field_result[y].append(0)
            for field in fields:
                field_result[y][x] += field[y][x]
            field_result[y][x] = round(field_result[y][x] / len(fields))


    return field_result